In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId', 'Name', 'Pclass', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)

In [4]:
df.head()

      Sex   Age     Fare  Survived
0    male  22.0   7.2500         0
1  female  38.0  71.2833         1
2  female  26.0   7.9250         1
3  female  35.0  53.1000         1
4    male  35.0   8.0500         0

In [7]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [8]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [9]:
inputs

        Sex   Age     Fare
0      male  22.0   7.2500
1    female  38.0  71.2833
2    female  26.0   7.9250
3    female  35.0  53.1000
4      male  35.0   8.0500
..      ...   ...      ...
886    male  27.0  13.0000
887  female  19.0  30.0000
888  female   NaN  23.4500
889    male  26.0  30.0000
890    male  32.0   7.7500

[891 rows x 3 columns]

In [12]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [13]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

      Sex   Age     Fare  female   male
0    male  22.0   7.2500   False   True
1  female  38.0  71.2833    True  False
2  female  26.0   7.9250    True  False
3  female  35.0  53.1000    True  False
4    male  35.0   8.0500   False   True

In [15]:
inputs.drop('Sex', axis='columns', inplace=True)

In [16]:
inputs.head()

    Age     Fare  female   male
0  22.0   7.2500   False   True
1  38.0  71.2833    True  False
2  26.0   7.9250    True  False
3  35.0  53.1000    True  False
4  35.0   8.0500   False   True

In [25]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [26]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [27]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [28]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [29]:
len(X_train)

712

In [30]:
len(X_test)

179

In [31]:
len(inputs)

891

In [32]:
model = GaussianNB()

In [ ]:
model.fit